[
    {
      "id": 1,
      "estate_title": "Spacious Family Home in Suburbia",
      "segment_name": "Single Family Home",
      "description": "Large family home located in a quiet suburban neighborhood, perfect for raising a family. Nestled in the peaceful embrace of a quiet suburban neighborhood in Denver, Colorado, this spacious family home offers the perfect sanctuary for raising a family. With its generous 2800 square feet of living space, this residence exudes warmth and comfort at every turn. The open floor plan creates a seamless flow between the living, dining, and kitchen areas, making it ideal for both daily living and entertaining. Featuring three bedrooms and two bathrooms, including a master suite, this home provides ample room for rest and relaxation. The addition of a dedicated study room offers a quiet space for work or hobbies, while the backyard and playground beckon for outdoor enjoyment and playtime. Conveniently located near essential amenities and reputable schools, this home combines the tranquility of suburban living with the convenience of urban accessibility. Whether it's enjoying a peaceful evening on the back porch or hosting gatherings with friends and family, this spacious family home provides the perfect backdrop for creating lasting memories and cherished moments.",
      "price": "$450,000/year",
      "status": "For Sale",
      "area": "2800 sq ft",
      "location": "Denver, Colorado",
      "facilities": ["Backyard", "StudyRoom", "Playground"],
      "image": "https://i.ibb.co/C9DVTK5/spacious-family-home-in-upmarket-suburb-img-20240227-wa0042-jpg.jpg",
      "image2": "https://i.ibb.co/X7DMf64/spacious-family-home-in-upmarket-suburb-img-20240227-wa0114-jpg.jpg",
      "image3": "https://i.ibb.co/NprwZqm/images-q-tbn-ANd9-Gc-SXdx-N4bf-Xeo-Wq-Zng-Zwew-RO5z-Xfn-CH-q-B3-U1-MXoib5-LIW1u7-K16-O3-Js-Qk-TA-LGc.jpg",
      "Beds": 3,
      "Baths": 2,
      "Garages": 2,
      "Deposit": "28%",
      "PoolSize": "300 Sq Ft",
      "AdditionalRooms": "Guest Bath",
      "LastRemodelYear": 2016,
      "Amenities": "Clubhouse",
      "Equipment": "Grill - Gas"
    },
    {
        "id": 2,
        "estate_title": "Modern Townhouse in Downtown",
        "segment_name": "Townhouse",
        "description": "Sleek and modern townhouse located in the heart of downtown, offering convenience and style. Nestled amidst the vibrant energy of downtown San Francisco, this sleek and contemporary townhouse embodies the essence of urban living at its finest. Boasting a stylish design and modern amenities, this residence offers both convenience and sophistication. Spread across 2000 square feet, the townhouse provides ample space for comfortable living and entertaining. The four bedrooms and four bathrooms are thoughtfully designed to provide privacy and luxury, while the expansive living areas offer flexibility for various lifestyle needs. From the sleek kitchen equipped with state-of-the-art appliances to the inviting living room featuring abundant natural light, every corner exudes a sense of elegance and comfort. Outdoor enthusiasts will appreciate the rooftop deck and balcony, perfect for soaking in the city skyline and enjoying al fresco dining or relaxation. With three garages providing ample parking space, convenience is paramount in this urban oasis. Located in the heart of San Francisco, residents are just moments away from a myriad of dining, shopping, and entertainment options, ensuring a vibrant and dynamic lifestyle. Experience the epitome of contemporary urban living with this modern townhouse in downtown San Francisco.",
        "price": "$750,000/year",
        "status": "For Rent",
        "area": "2000 sq ft",
        "location": "San Francisco, California",
        "facilities": ["Roof Deck", "Balcony", "Garage"],
        "image": "https://i.ibb.co/3SGkDJT/modern-townhouse-design-house-168058-939.jpg",
        "image2": "https://i.ibb.co/NrTxwLr/aa5e0cf200aaed6146804becc10bc608-full.jpg",
        "image3": "https://i.ibb.co/N1rDYsR/MRD11991074-2.jpg",
        "Beds": 4,
        "Baths": 4,
        "Garages": 3,
        "Deposit": "28%",
        "PoolSize": "300 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2010,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 3,
        "estate_title": "Luxury High-Rise Apartment",
        "segment_name": "Apartment",
        "description": "Elegant high-rise apartment offering breathtaking city views and luxurious amenities. Perched high above the bustling streets of New York City, this luxury high-rise apartment epitomizes sophistication and urban elegance. With expansive windows framing breathtaking city views, every glance from this 1800 square feet residence is a testament to the allure of metropolitan living. Step inside to discover a world of refined luxury and modern convenience. The spacious layout encompasses five bedrooms and five bathrooms, each exquisitely appointed with the finest materials and finishes. Whether it's hosting lavish gatherings in the open-concept living areas or unwinding on the private balcony, this apartment offers an unparalleled level of comfort and style. Residents of this prestigious address also enjoy access to a host of luxurious amenities, including a state-of-the-art gym and an inviting swimming pool, providing the perfect retreat from the hustle and bustle of city life. Located in the vibrant heart of New York City, this high-rise apartment offers unparalleled access to world-class dining, shopping, and entertainment options. Experience the pinnacle of urban living in this exquisite luxury residence.",
        "price": "$4,200,00/year",
        "status": "For Sale",
        "area": "1800 sq ft",
        "location": "New York City, New York",
        "facilities": ["Balcony", "Gym", "Swimming"],
        "image": "https://i.ibb.co/Jvy7mck/Zaha-Hadid-Mexico-1.jpg",
        "image2": "https://i.ibb.co/dc0RB8N/Lux-Expose-PLG-NYC-12.jpg",
        "image3": "https://i.ibb.co/Z6CGv1G/images-q-tbn-ANd9-Gc-Qtgy-PRg6pief-Tx7ifhtg-Vi4xs-IWXQ3-A9-Qxc-EDMo-U9-BXg-s.jpg",
        "Beds": 5,
        "Baths": 5,
        "Garages": 2,
        "Deposit": "18%",
        "PoolSize": "400 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2002,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 4,
        "estate_title": "Cozy Studio Apartment",
        "segment_name": "Apartment",
        "description": "Compact studio apartment perfect for young professionals or students, located in a vibrant neighborhood. Nestled in the heart of a vibrant neighborhood in Seattle, Washington, this cozy studio apartment offers an inviting retreat for young professionals or students seeking a comfortable and convenient living space. With its compact layout spanning 600 square feet, this residence maximizes every inch to provide a functional yet stylish environment. The studio apartment features three bedrooms and two bathrooms, offering ample space for both living and relaxation. A private balcony provides the perfect spot to enjoy morning coffee or soak in the city views. Convenience is paramount with on-site laundry facilities and access to a fitness center, ensuring that daily tasks are easily managed.  Located in a bustling neighborhood, residents have easy access to a variety of dining, shopping, and entertainment options, making it an ideal location for those who enjoy an active lifestyle. With its prime location and comfortable amenities, this cozy studio apartment presents an excellent opportunity for those looking to embrace urban living in Seattle.",
        "price": "$300,000/year",
        "status": "For Sale",
        "area": "600 sq ft",
        "location": "Seattle, Washington",
        "facilities": ["Balcony", "Laundry", "FitnessCenter"],
        "image": "https://i.ibb.co/6DgCkbr/3d97f55461a8df8cc3dbb7724fc6e70f.jpg",
        "image2": "https://i.ibb.co/HxytTLG/fffdsgdfhd-scaled.jpg",
        "image3": "https://i.ibb.co/XLkXSBj/3c4f82792987a3ae3f43a529b5230807.jpg",
        "Beds": 3,
        "Baths": 2,
        "Garages": 1,
        "Deposit": "22%",
        "PoolSize": "400 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2010,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 5,
        "estate_title": "Student Dormitory near University",
        "segment_name": "Student Housing",
        "description": "Purpose-built student dormitory offering affordable accommodation close to campus.  Conveniently situated near the bustling campus of a prestigious university in Los Angeles, California, this purpose-built student dormitory offers an ideal living solution for students seeking affordable and comfortable accommodation. Designed with the needs of modern students in mind, this dormitory provides a shared living space that fosters a sense of community and camaraderie. The dormitory features a cozy bedroom with ample space for rest and study, ensuring that students can maintain a balanced lifestyle while pursuing their academic endeavors. Additionally, communal study rooms provide the perfect environment for collaborative learning and group projects. Beyond academics, residents can unwind and socialize on the sun deck, soaking in the warm California sun and enjoying panoramic views of the surrounding cityscape. Laundry facilities are conveniently located on-site, streamlining daily chores for busy students. Located in the vibrant city of Los Angeles, residents have access to a myriad of cultural, dining, and entertainment options, ensuring a well-rounded college experience. With its affordable rates and convenient amenities, this student dormitory offers the perfect balance of comfort and affordability for students embarking on their academic journey in Los Angeles.",
        "price": "$800/month",
        "status": "For Rent",
        "area": "Shared",
        "location": "Los Angeles, California",
        "facilities": ["StudyRooms", "Sun Deck", "Laundry"],
        "image": "https://i.ibb.co/WkHNnVG/Studio-Penthouse-Bed-and-Desk-scaled.jpg",
        "image2": "https://i.ibb.co/G0nD2T1/Wroclaw-hotel-kitchen2-resized-1.jpg",
        "image3": "https://i.ibb.co/ChVTT3H/Potsdam-studio-room1.jpg",
        "Beds": 1,
        "Baths": 1,
        "Garages": 2,
        "Deposit": "8%",
        "PoolSize": "250 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2005,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 6,
        "estate_title": "Retirement Village for Active Seniors",
        "segment_name": "Senior Living Community",
        "description": "Vibrant retirement community designed for active seniors, offering a range of amenities and activities. Nestled in the serene landscapes of Scottsdale, Arizona, this retirement village is tailor-made for active seniors seeking a vibrant and fulfilling lifestyle in their golden years. Designed with a focus on fostering community and wellness, this village offers a range of amenities and activities to cater to the diverse interests and needs of its residents. From the moment you step foot into this vibrant community, you're greeted by the warm embrace of like-minded individuals and a plethora of opportunities for social engagement and recreation. The clubhouse serves as the heart of the community, providing a welcoming space for gatherings, events, and socializing. For those with a passion for staying active, the village boasts a pristine golf course and offers fitness classes tailored to all levels of ability. Residents can also take advantage of the lush outdoor spaces for leisurely strolls or simply enjoying the Arizona sunshine. With spacious accommodations featuring three bedrooms, two bathrooms, and two garages, residents can enjoy the comfort and privacy of their own homes while being part of a supportive and dynamic community. Embrace the joy of retirement living in this vibrant village designed for active seniors.",
        "price": "$240,000/year",
        "status": "For Sale",
        "area": "Varies",
        "location": "Scottsdale, Arizona",
        "facilities": ["Clubhouse", "GolfCourse", "FitnessClasses"],
        "image": "https://i.ibb.co/Twtqp08/usgbc-green-retirement-56a45f4b5f9b58b7d0d6a3ff.jpg",
        "image2": "https://i.ibb.co/6g4qRmt/memory-care-home-min.jpg",
        "image3": "https://i.ibb.co/4FHdbWN/Why-Are-All-Inclusive-Retirement-Communities-Perfect-For-Active-Seniors.jpg",
        "Beds": 3,
        "Baths": 2,
        "Garages": 2,
        "Deposit": "26%",
        "PoolSize": "300 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2010,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 7,
        "estate_title": "Beachfront Villa",
        "segment_name": "Vacation Rental",
        "description": "Luxurious beachfront villa offering stunning ocean views and private access to the beach. Perched majestically on the sun-kissed shores of Maui, Hawaii, this beachfront villa epitomizes luxury and tranquility. With its unparalleled location and stunning ocean vistas, this retreat offers an unrivaled escape from the hustle and bustle of everyday life. Step inside the spacious confines of this 3000 square feet villa to discover a haven of comfort and style. Boasting three bedrooms and three bathrooms, each impeccably appointed with upscale furnishings and modern amenities, every corner exudes an air of sophistication. Outside, a private pool beckons, inviting you to cool off in its azure waters or bask in the warm Hawaiian sun on the expansive sun deck. Meanwhile, a playground provides entertainment for younger guests, ensuring fun-filled days for the whole family. Venture beyond the villa's confines and find yourself on the pristine sands of the beach, where you can indulge in leisurely strolls along the shoreline or exhilarating water sports in the crystalline waters. With its blend of luxury, serenity, and natural beauty, this beachfront villa offers an idyllic retreat for those seeking the ultimate Hawaiian getaway. Experience the epitome of island living in this exquisite haven on Maui's shores.",
        "price": "$500/night",
        "status": "For Rent",
        "area": "3000 sq ft",
        "location": "Maui, Hawaii",
        "facilities": ["Pool", "Playground", "Sun Deck"],
        "image": "https://i.ibb.co/5TY5jnz/25solemare-1200.jpg",
        "image2": "https://i.ibb.co/xLPmF0W/images-q-tbn-ANd9-Gc-Sj-TXv-LFQCGBe-2-Xo0-Sa-Ti-0-Pv-Tn-BQgp-QRTj1-RJJ2-JLWX2o8mfd96j-Vst-Ylx3-Eq-v.jpg",
        "image3": "https://i.ibb.co/g62rwtN/Nevaehfrombeach-1200.jpg]",
        "Beds": 3,
        "Baths": 3,
        "Garages": 1,
        "Deposit": "20%",
        "PoolSize": "200 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2001,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 8,
        "estate_title": "Mountain Cabin Retreat",
        "segment_name": "Vacation Rental",
        "description": "Cozy cabin nestled in the mountains, offering a peaceful retreat from city life. Nestled amidst the majestic mountains of Aspen, Colorado, this charming mountain cabin retreat beckons with its rustic charm and serene surroundings. Offering a peaceful sanctuary away from the hustle and bustle of city life, this cozy cabin is the perfect destination for those seeking solitude and tranquility. With 1200 square feet of living space, the cabin boasts four bedrooms and four bathrooms, providing ample room for families or groups of friends to unwind and reconnect. Each room exudes warmth and comfort, adorned with rustic furnishings and adorned with picturesque views of the surrounding wilderness. Outside, guests can immerse themselves in nature's beauty while enjoying the cabin's amenities, including a rejuvenating hot tub, a crackling fire pit, and access to nearby hiking trails. Whether soaking in the bubbling waters of the hot tub under a starlit sky or roasting marshmallows around the fire pit, every moment spent here is filled with relaxation and rejuvenation. Located in the heart of Aspen, guests have easy access to a wealth of outdoor activities, from skiing and snowboarding in the winter to hiking and mountain biking in the summer. With its idyllic setting and cozy ambiance, this mountain cabin retreat offers an unforgettable escape for nature lovers and outdoor enthusiasts alike.",
        "price": "$300/night",
        "status": "For Rent",
        "area": "1200 sq ft",
        "location": "Aspen, Colorado",
        "facilities": ["Hot Tub", "Fire Pit", "HikingTrails"],
        "image": "https://i.ibb.co/991pY2K/1.jpg",
        "image2": "https://i.ibb.co/27rfHqQ/1-DJI-0120.jpg",
        "image3": "https://i.ibb.co/LQwSght/IG2-The-airy-interior-of-a-cabin-rental-in-northern-Georgia.jpg",
        "Beds": 4,
        "Baths": 4,
        "Garages": 2,
        "Deposit": "28%",
        "PoolSize": "300 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2010,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      },
      {
        "id": 9,
        "estate_title": "Traditional Colonial House",
        "segment_name": "Single Family Home",
        "description": "Classic colonial-style house with spacious rooms and a large backyard, perfect for family gatherings. Embodying the timeless elegance of colonial architecture, this splendid residence stands as a beacon of charm and comfort in the heart of Boston, Massachusetts. Stepping into this traditional colonial house, one is greeted by spacious rooms adorned with classic details, evoking a sense of warmth and sophistication. With three bedrooms, two bathrooms, and a sprawling 3200 square feet of living space, this home offers ample room for family living and entertaining. Beyond its inviting interiors, the house boasts a generous backyard, providing the perfect setting for outdoor gatherings and leisurely afternoons spent in the sunshine. A meticulously landscaped garden, complete with lush greenery and vibrant flowers, adds to the home's curb appeal and creates a tranquil retreat in the midst of the bustling city. Inside, a cozy fireplace invites relaxation on chilly evenings, while a charming deck offers a picturesque spot for al fresco dining or morning coffee. With two garages providing convenient parking and storage, this residence seamlessly blends classic elegance with modern convenience. Perfectly positioned in one of Boston's most sought-after neighborhoods, this traditional colonial house offers a timeless sanctuary for discerning buyers seeking a place to call home.",
        "price": "$550,000/year",
        "status": "For Sale",
        "area": "3200 sq ft",
        "location": "Boston, Massachusetts",
        "facilities": ["Garden", "Fireplace", "Deck"],
        "image": "https://i.ibb.co/5jwcWQt/american-colonial-style-architecture-5094947-hero-cf7de7e2627c4e07895a964cc0e6dc10.jpg",
        "image2": "https://i.ibb.co/Tqh9hst/images-q-tbn-ANd9-Gc-Sn7k-WXtk-ESqy-JKn4q4-Rg-PALKa-Uun-H0-ALSEw-Hacrm-Mag-s.jpg",
        "image3": "https://i.ibb.co/mvK8PwF/colonialnyi-stil-v-interiere-pufikhomes-10.jpg",
        "Beds": 3,
        "Baths": 2,
        "Garages": 2,
        "Deposit": "12%",
        "PoolSize": "100 Sq Ft",
        "AdditionalRooms": "Guest Bath",
        "LastRemodelYear": 2015,
        "Amenities": "Clubhouse",
        "Equipment": "Grill - Gas"
      }
]